In [2]:
import pandas
pandas.__version__

'1.4.2'

In [3]:
import numpy as np
import pandas as pd

In [4]:
pd.DataFrame(np.random.randint(2,12),
             columns = ['foo','doo'],
             index =['a','b','c'])

   foo  doo
a   11   11
b   11   11
c   11   11

In [5]:
#pandas index object
ind = pd.Index([20,34,57,7,1,8])
ind

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [6]:
ind[1]

34

In [7]:
ind[::]            #whole data is fetched

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [11]:
ind[1:6:3]

Int64Index([34, 1], dtype='int64')

In [12]:
ind[0:4]

Int64Index([20, 34, 57, 7], dtype='int64')

In [8]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

6 (6,) 1 int64

In [9]:
ind[1] = 0               #ind are immutable

TypeError: Index does not support mutable operations

In [14]:
#Operations on Data in Panda
#Ufuncs

rng = np.random.RandomState(10)
rng

RandomState(MT19937) at 0x2C8FDC05240

In [17]:
ser = pd.Series(rng.randint(0,10,4))
ser

0    5
1    3
2    9
3    6
dtype: int32

In [16]:
dfr = pd.DataFrame(rng.randint(0,10,(5,4)),
                   columns = ['A','B','C','D'])
dfr

   A  B  C  D
0  9  0  1  8
1  9  0  8  6
2  4  3  0  4
3  6  8  1  8
4  4  1  3  6

In [18]:
np.exp(ser)

0     148.413159
1      20.085537
2    8103.083928
3     403.428793
dtype: float64

In [19]:
np.sin(dfr* np.pi /4)

              A             B             C             D
0  7.071068e-01  0.000000e+00  7.071068e-01 -2.449294e-16
1  7.071068e-01  0.000000e+00 -2.449294e-16 -1.000000e+00
2  1.224647e-16  7.071068e-01  0.000000e+00  1.224647e-16
3 -1.000000e+00 -2.449294e-16  7.071068e-01 -2.449294e-16
4  1.224647e-16  7.071068e-01  7.071068e-01 -1.000000e+00

In [21]:
#Universal fun index alignment
area = pd.Series({'Alaska': 1723337, 'Texas':695662,
                 'California':423967},name = 'area')
popn= pd.Series({'California':38332521,'Texas':26448193,
                'New York':19651127},name = 'population')
print(area)
popn

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [22]:
popn/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [24]:
area.index | popn.index          #| is or oprn

C:\Users\ASUS\AppData\Local\Temp\ipykernel_10100\384068274.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | popn.index          #| is or oprn

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [26]:
A = pd.Series([2,4,6], index = [0,1,2])
B = pd.Series([1,3,5], index = [1,2,3])
print(A)
print(B)

A+B

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [27]:
A.add(B,fill_value=0)            #NaN values are replaced with '0'

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [53]:
#oprn b/w DataFrame and Series
data = {'Province':['FL','FL','NH','NH','ZH'],
        'Year':[2013,2014,2013,2014,2014],
        'Literacy':[0.2,0.1,0.5,0.3,0.5]}
data = pd.DataFrame(data)
df = pd.DataFrame(data, columns = ['Year','Province','Literacy'])
df['nonsense']=df.Year/df.Literacy
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2,3,4])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [54]:
df2 = pd.DataFrame({'Province':['FL','NH','ZH'], 'Populaion':['100000','200000','300000']})
df2

  Province Populaion
0       FL    100000
1       NH    200000
2       ZH    300000

In [55]:
df.merge(df2)

   Year Province  Literacy      nonsense  Serie_aligned Populaion
0  2013       FL       0.2  10065.000000              0    100000
1  2014       FL       0.1  20140.000000              1    100000
2  2013       NH       0.5   4026.000000              2    200000
3  2014       NH       0.3   6713.333333              3    200000
4  2014       ZH       0.5   4028.000000              4    300000

In [57]:
df3 = pd.DataFrame({'Province':['FL','NH'], 'Populaion':['100000','200000']})
df3
df.merge(df3,right_on = 'Province',left_on='Province')

   Year Province  Literacy      nonsense  Serie_aligned Populaion
0  2013       FL       0.2  10065.000000              0    100000
1  2014       FL       0.1  20140.000000              1    100000
2  2013       NH       0.5   4026.000000              2    200000
3  2014       NH       0.3   6713.333333              3    200000

In [58]:
df4 = pd.DataFrame({'Province':['FL','NH','UT'], 'Populaion':['100000','200000','50000']})
df.merge(df4,how='outer')

     Year Province  Literacy      nonsense  Serie_aligned Populaion
0  2013.0       FL       0.2  10065.000000            0.0    100000
1  2014.0       FL       0.1  20140.000000            1.0    100000
2  2013.0       NH       0.5   4026.000000            2.0    200000
3  2014.0       NH       0.3   6713.333333            3.0    200000
4  2014.0       ZH       0.5   4028.000000            4.0       NaN
5     NaN       UT       NaN           NaN            NaN     50000

In [59]:
df5 = pd.DataFrame({'Province':['FL','NH','FL'], 'Populaion':['100000','200000','300000']})
print(df)
df.merge(df5,how='outer')

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

   Year Province  Literacy      nonsense  Serie_aligned Populaion
0  2013       FL       0.2  10065.000000              0    100000
1  2013       FL       0.2  10065.000000              0    300000
2  2014       FL       0.1  20140.000000              1    100000
3  2014       FL       0.1  20140.000000              1    300000
4  2013       NH       0.5   4026.000000              2    200000
5  2014       NH       0.3   6713.333333              3    200000
6  2014       ZH       0.5   4028.000000              4       NaN

In [63]:
serie_a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
                   index = ['f','e','d','c','b','a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                   index = ['f','e','d','c','b','a'])

In [64]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [65]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [66]:
pd.Series(np.where(pd.isnull(serie_a), serie_b,serie_a), index = serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [68]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64